### 0310 수업 복습  
---

## 판다스에서 제공하는 두 가지 데이터 구조  
- 데이터프레임 : 행과 열로 이루어진 표  
- 시리즈 : 데이터 프레임 중 1개의 열을 시리즈 -> 시리즈가 모여 데이터프레임을 구성한다!  
---

In [2]:
# 라이브러리 불러오기
import pandas as pd

In [3]:
# 타이타닉 데이터를 사용하기 위해 seaborn 라이브러리를 불러온다.
import seaborn as sns
tt = sns.load_dataset('titanic')

In [4]:
# 데이터 구조 확인 - 데이터프레임
type(tt)

pandas.core.frame.DataFrame

In [5]:
tt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
# 데이터 구조 확인 - 시리즈 ex) pclass
type(tt['pclass'])

pandas.core.series.Series

In [7]:
# 시리즈는 빠른 연산이 가능하다.
tt['pclass'] * 50

0      150
1       50
2      150
3       50
4      150
      ...
886    100
887     50
888    150
889     50
890    150
Name: pclass, Length: 891, dtype: int64

In [8]:
# 행과 열의 개수를 확인 -> shape 문법을 사용한다!
print(tt.shape)
print(tt.shape[0]) # 이 경우 행(row)의 개수를 출력해준다.
print(tt.shape[1]) # 이 경우 열(column)의 개수를 출력해준다.

(891, 15)
891
15

In [9]:
# 데이터 프레임 열의 항목들을 확인하고 싶다. -> columns 문법을 사용한다!
tt.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [10]:
# 데이터 프레임에 대한 전반적인 정보를 확인하고 싶다. -> info() 문법을 사용한다!
# 데이터 프레임을 구성하는 행과 열의 크기, 컬럼명, 컬럼을 구성하는 값의 자료형 등을 알려준다.
tt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [11]:
# 데이터 프레임 중 컬럼들의 자료형만 확인하고 싶다. -> dtype 문법을 사용한다!
tt.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [12]:
# 데이터 프레임 중 정수, 실수형 컬럼들의 기초통계값을 확인하고 싶다. -> describe() 문법을 사용한다!
tt.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [13]:
# 나는 그런데 데이터 프레임의 모든 컬럼들에 대해 기초통계값을 확인하고 싶어. -> describe(include=all) 문법을 사용한다!
tt.describe(include='all')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
# 데이터 프레임 중 가장 앞쪽에 있는 5개 행을 보고 싶다. -> head() 문법을 사용한다!
tt.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
# 데이터 프레임 중 가장 뒤쪽에 있는 5개 행을 보고 싶다. -> tail() 문법을 사용한다!
tt.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

## 데이터프레임의 행과 열로 데이터를 추출하자!  
---

### 열을 기준으로 접근하는 방법  
- column의 이름을 통해 직접 접근할 수 있다.

In [16]:
# 원하는 열을 골라서 추출해보자!
tt_cf = tt[['class', 'fare']]
tt_cf

      class     fare
0     Third   7.2500
1     First  71.2833
2     Third   7.9250
3     First  53.1000
4     Third   8.0500
..      ...      ...
886  Second  13.0000
887   First  30.0000
888   Third  23.4500
889   First  30.0000
890   Third   7.7500

[891 rows x 2 columns]

### 행을 기준으로 접근하는 방법은 대표적으로 2가지가 있다.  
- loc[index] ]  
- iloc[index] ]  
- iloc의 경우 iloc[[-1]]을 통해 마지막 행에 접근할 수 있다. (loc의 경우 불가)

In [17]:
# loc[] ex)
tt.loc[1]

survived               1
pclass                 1
sex               female
age                 38.0
sibsp                  1
parch                  0
fare             71.2833
embarked               C
class              First
who                woman
adult_male         False
deck                   C
embark_town    Cherbourg
alive                yes
alone              False
Name: 1, dtype: object

In [18]:
# iloc[] ex)
tt.iloc[1]

survived               1
pclass                 1
sex               female
age                 38.0
sibsp                  1
parch                  0
fare             71.2833
embarked               C
class              First
who                woman
adult_male         False
deck                   C
embark_town    Cherbourg
alive                yes
alone              False
Name: 1, dtype: object

In [19]:
# iloc[-1]
tt.iloc[-1]

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [20]:
# loc[-1]
tt.loc[-1]
# 그러면 index의 개수가 무수히 많은 경우 loc를 통해서 확인하려면 어떻게 해야할까?

KeyError: -1

In [ ]:
# shape[0]을 활용해서 행의 개수를 출력한 뒤 개수에서 1을 빼고 할당해주면 된다.
last_row_num = tt.shape[0] - 1
tt.loc[last_row_num] # tt.iloc[-1]과 동일하게 출력되었다!

In [ ]:
# loc[]와 iloc[] 모두 여러 행을 출력할 수 있다.
tt.loc[[0, 10, 100, last_row_num]]

In [ ]:
tt.iloc[[0, 10, 100, -1]]

### 슬라이싱과 range()를 통해 여러 행을 출력해보자.  
- [시작점:끝점:증가폭]  ]

In [ ]:
tt.iloc[0:last_row_num:5]

In [ ]:
tt.loc[0:last_row_num:10]

In [ ]:
tt.loc[list(range(0, tt.shape[0], 10))]

### 행과 열로 동시에 접근을 해서 데이터를 확인해보자!

In [ ]:
# column을 기준으로 하고 해당 컬럼의 마지막 인덱스 번째의 값을 출력해보자.
tt['fare'].loc[last_row_num]

### loc와 iloc의 차이점  
- iloc는 column을 숫자로만 접근할 수 있다. (loc는 column명으로 접근 가능)

In [ ]:
# loc로 특정 열의 인덱스들만을 출력해보자. (행 -> 열)
tt.loc[0:last_row_num:5, ['fare', 'class']]

In [ ]:
# (열 -> 행)
tt[['fare', 'class']].loc[0:last_row_num:5]

In [ ]:
tt.iloc[0:last_row_num:5, 'fare', 'class'] # 오류가 발생한다.

In [ ]:
# iloc의 경우 열도 숫자로
tt.iloc[0:last_row_num:5, [6, 8]]

### 기초통계치에 대한 값을 구하는 것을 배우고 응용  
- pandas 라이브러리에서 제공되는 mean, sum, std, median, 기타 등등을 사용가능하다!  
- numpy 라이브러리에서 제공하는 np.mean, np.argmax, np.std  
---

In [ ]:
import numpy as np

In [ ]:
print(tt['fare'].mean())
print(tt['fare'].sum())
print(tt['fare'].median())

In [ ]:
# 평균값을 반환한다.
np.mean(tt['age'])

In [ ]:
# 최대값의 인덱스를 반환한다.
np.argmax(tt['age'])

In [ ]:
# 최소값의 인덱스를 반환한다.
np.argmin(tt['age'])

In [ ]:
tt

In [ ]:
# pclass별 fare 평균을 구해보자.
# 먼저 groupby 함수를 이용하여 겹치는 데이터끼리 묶고 값을 확인한다.
# groupby('그룹을 묶을 컬럼')['통계치를 볼 컬럼'].원하는 통계치()
tt.groupby('pclass')['fare'].mean()

In [ ]:
# pclass별 fare 합
tt.groupby('pclass')['fare'].sum()

In [ ]:
# pclas별 생존자 수 합
tt.groupby('pclass')['survived'].sum()

## query()  
- 데이터를 추출하기 위한 조건  
- 요소의 특정값을 접근해서 데이터를 추출하는 케이스  
- ex) tt.query('요구조건')

In [26]:
tt.query(''' embarked == "S" ''')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [27]:
tt.query(''' embarked == "C" ''')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,1,2,female,27.0,1,0,13.8583,C,Second,woman,False,NaN,Cherbourg,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [28]:
# 수치형 데이터로 접근하기 위해 age의 mean()을 도출한다.
tt.age.mean()

29.69911764705882

In [29]:
tt.query("age >= 29.69911764705882")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
873,0,3,male,47.0,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [30]:
# and 연산
tt.query("age >= 29.69911764705882 and pclass == 1")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
867,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False

In [31]:
# or 연산
tt.query("age >= 29.69911764705882 or pclass == 1")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [34]:
# 여러 조건을 넣어서 진행해보자
tt.query(''' embarked != "C" and age >= 29.69911764705882 and fare < 60 ''')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
873,0,3,male,47.0,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### Q1. embarked != "C" and age >= 29.69911764705882 and fare < 60 이 승객들의 생존자는?
- 1이 생존한 경우 -> 1을 다 더하면 생존자

In [35]:
tt.query(''' embarked != "C" and age >= 29.69911764705882 and fare < 60 and survived == 1 ''')['survived'].sum()

75